# pandas
It provides two primary data structures: Series ans Data Frame

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mmond\venv\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mmond\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\mmond\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   -- ------------------------------------- 0.8/11.5 MB 202.1 kB/s eta 0:00:54
   -- ------------------------------------- 0.8/11.5 MB 202.1 kB/s eta 0:00:54
   --- ------------------------------------ 1.0/11.5 MB 255.5 kB/s eta 0:00:41
   ---- ----------------------------------- 1.3/11.5 MB 322.6 kB/s eta 0:00:32
   ----- ---------------------------------- 1.6/11.5 MB 371.1 kB/s eta 0:00:27
   ------ --------------------------------- 1.8/11.5 MB 410.9 kB/s eta 0:00:24
   ------- -------------------------------- 2.1/11.5 MB 456.9 kB/s eta 0:00:21
   -------- ------------------------------- 2.4/11.5 MB 497.1 kB/s eta 0:00:19
   --------- ------------------------------ 2.6/11.5 MB 541.1 kB/s eta 0:00:17
   ---------- ----------------------------- 2.9/11.5 MB 564.8 kB/s eta 0:00:16
   ---------- ----------------------------- 3.1/11.5 MB 595.3 kB/s eta 0:00:15
   ----------- ---------------------------- 3.4/11.5 MB 623.3 kB/s eta 0:00:13
   ------------ --------------------------- 3.7/11.5 MB 647.1 kB/s eta 0:00:13
   ------------- -------------------------- 3.9/11.5 MB 659.7 kB/s eta 0:00:12
   -------------- ------------------------- 4.2/11.5 MB 691.3 kB/s eta 0:00:11
   --------------- ------------------------ 4.5/11.5 MB 712.0 kB/s eta 0:00:10
   ---------------- ----------------------- 4.7/11.5 MB 733.2 kB/s eta 0:00:10
   ----------------- ---------------------- 5.0/11.5 MB 740.2 kB/s eta 0:00:09
   ------------------ --------------------- 5.2/11.5 MB 764.4 kB/s eta 0:00:09
   ------------------- -------------------- 5.5/11.5 MB 782.2 kB/s eta 0:00:08
   -------------------- ------------------- 5.8/11.5 MB 797.0 kB/s eta 0:00:08
   -------------------- ------------------- 6.0/11.5 MB 813.0 kB/s eta 0:00:07
   --------------------- ------------------ 6.3/11.5 MB 814.0 kB/s eta 0:00:07
   ---------------------- ----------------- 6.6/11.5 MB 833.6 kB/s eta 0:00:06
   ----------------------- ---------------- 6.8/11.5 MB 849.0 kB/s eta 0:00:06
   ------------------------ --------------- 7.1/11.5 MB 847.0 kB/s eta 0:00:06
   ------------------------- -------------- 7.3/11.5 MB 859.5 kB/s eta 0:00:05
   -------------------------- ------------- 7.6/11.5 MB 869.9 kB/s eta 0:00:05
   --------------------------- ------------ 7.9/11.5 MB 876.6 kB/s eta 0:00:05
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.9/11.5 MB 692.1 kB/s eta 0:00:04
   ------------------------------- -------- 9.2/11.5 MB 700.8 kB/s eta 0:00:04
   -------------------------------- ------- 9.4/11.5 MB 709.2 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   ---------------------------------- ----- 10.0/11.5 MB 705.4 kB/s eta 0:00:03
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ------------------------------------ --- 10.5/11.5 MB 603.1 kB/s eta 0:00:02
   ------------------------------------ --- 10.5/11.5 MB 603.1 kB/s eta 0:00:02
   ------------------------------------- -- 10.7/11.5 MB 600.2 kB/s eta 0:00:02
   ------------------------------------- -- 10.7/11.5 MB 600.2 kB/s eta 0:00:02
   -------------------------------------- - 11.0/11.5 MB 601.8 kB/s eta 0:00:01
   -------------------------------------- - 11.0/11.5 MB 601.8 kB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 605.3 kB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 610.8 kB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

# Series
A panda series is a one dimensional array-like object that can hold any dtaa type. It is similar tot a column in a table.

In [2]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series: \n",series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

Creat a series from dictionary

In [3]:
data={'a':1,'b':2,'c':3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30]
index=['a','b','c']
seris=pd.Series(data,index=index)
print(seris)

a    10
b    20
c    30
dtype: int64

# Dataframe
create a dataframe from a dictionary of list

In [5]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
data_frame=pd.DataFrame(data)
print(data_frame)

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

In [6]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series: \n",series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

Create a dataframe from a list of dictionaries

In [7]:
data=[{'name':'Istiak','age':25,'city':'Dhaka'},
       {'name':'John','age':27,'city':'Dinazpur'},
       {'name':'Jack','age':28,'city':'Germany'}
    ]
df=pd.DataFrame(data)
print(type(data))
print(df)

<class 'list'>
     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

# Reading from csv file

In [18]:
df=pd.read_csv('sales_data.csv')
print(df)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

First 5 lines from the csv file

In [16]:
df=pd.read_csv('sales_data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

Last 5 lines from the csv file

In [15]:
df=pd.read_csv('sales_data.csv')
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

Accessing data from dataframe

In [ ]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df['name'])

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

0    Istiak
1      John
2      Jack
Name: name, dtype: object

0       Dhaka
1    Dinazpur
2     Germany
Name: city, dtype: object

df.loc [ ] Operation

In [54]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.loc[1])
print()
df.loc[0][2]

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

name        John
age           27
city    Dinazpur
Name: 1, dtype: object

C:\Users\mmond\AppData\Local\Temp\ipykernel_6460\3609176066.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Dhaka'

df.iloc [ ] Operation

In [52]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.iloc[1])
print()
df.iloc[1][2]

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

name        John
age           27
city    Dinazpur
Name: 1, dtype: object

C:\Users\mmond\AppData\Local\Temp\ipykernel_6460\3925078486.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Dinazpur'

Accessing a specified element using "df.at [ int, 'attribute' ]"

In [58]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.at[2,'city'])
print()
print(print(df.at[1,'age']))

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Germany

27
None

Accessing a specified element using "df.iat [ int, int ]"

In [60]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.iat[2,2])
print()
print(print(df.iat[1,0]))

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Germany

John
None

# Data Manipulation
Adding a column

In [89]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
df['salary']=[20000,30000,50000]
df

     name  age      city  salary
0  Istiak   25     Dhaka   20000
1    John   27  Dinazpur   30000
2    Jack   28   Germany   50000

It drops a column temporarily by using "df.drop('obg',axis=int)"

In [ ]:
df.drop('salary',axis=1)

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

In [91]:
df

     name  age      city  salary
0  Istiak   25     Dhaka   20000
1    John   27  Dinazpur   30000
2    Jack   28   Germany   50000

Parmanently drop the column by using "df.drop('obg',axis=int, inplace=True)"

In [ ]:
df.drop('salary',axis=1,inplace=True)
df

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Show the data types

In [100]:
df.dtypes

name    object
age      int64
city    object
dtype: object

It describe the statistical summery

In [101]:
df.describe()

             age
count   3.000000
mean   27.666667
std     1.527525
min    26.000000
25%    27.000000
50%    28.000000
75%    28.500000
max    29.000000

# Practice
Incrementing all the age by 1

In [98]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print("After Incrementing age by 1 year")
df['age']=df['age']+1
df

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany
After Incrementing age by 1 year

     name  age      city
0  Istiak   26     Dhaka
1    John   28  Dinazpur
2    Jack   29   Germany

In [99]:
df.dtypes

name    object
age      int64
city    object
dtype: object